#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

	ПересчитатьСуммуСтроки(Элементы.Товары.ТекущиеДанные, "Поменялось количество");

КонецПроцедуры
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)

	ПересчитатьСуммуСтроки(Элементы.Товары.ТекущиеДанные, "Поменялась цена");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ПересчитатьСуммуСтроки(ТекущиеДанные, СообщениеДляПользователя)

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = СообщениеДляПользователя;
	Сообщение.Сообщить();


	Человек = ОписаниеЧеловека();

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Человек.Имя;
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Функция ОписаниеЧеловека()

	Описание = Новый Структура;
	Описание.Вставить("Имя", "Иван");
	Описание.Вставить("ДатаРождения", ТекущаяДата());
	Описание.Вставить("Фамилия", "Иванов");
	Описание.Вставить("Отчество", "Иванович");
	Описание.Вставить("Стаж", 10);
	Описание.Вставить("Уволен", Ложь);

	Возврат Описание;

КонецФункции
#КонецОбласти